nxp-mcuxpresso/mcux-soc-svd/MCXN556S/MCXN556S_cm33_core1.xml
        <register>
          <name>EXT_TRIG0</name>
          <description>EXT Trigger Connections</description>
          <addressOffset>0x4C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>TRIG_OUTa pin input connections</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>PINT PIN_INT0 input is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>PINT PIN_INT1 input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>ADC0_IRQ input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>ADC1_IRQ input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>ADC0_tcomp[0] input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>ADC1_tcomp[0] input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>PWM0_SM0_MUX_TRIG0/PWM0_SM0_MUX_TRIG1 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>PWM0_SM1_MUX_TRIG0/PWM0_SM1_MUX_TRIG1 input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>PWM0_SM2_MUX_TRIG0/PWM0_SM2_MUX_TRIG1 input is selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>PWM0_SM3_MUX_TRIG0/PWM0_SM3_MUX_TRIG1 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>PWM1_SM0_MUX_TRIG0/PWM1_SM0_MUX_TRIG1 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>PWM1_SM1_MUX_TRIG0/PWM1_SM1_MUX_TRIG1 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>PWM1_SM2_MUX_TRIG0/PWM1_SM2_MUX_TRIG1 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>PWM1_SM3_MUX_TRIG0/PWM1_SM3_MUX_TRIG1 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>QDC0_CMP/POS_MATCH input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>QDC1_CMP/POS_MATCH input is selected</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>EVTG_OUT0A input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>EVTG_OUT0B input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>EVTG_OUT1A input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>EVTG_OUT1B input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>EVTG_OUT2A input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>EVTG_OUT2B input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>EVTG_OUT3A input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>EVTG_OUT3B input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>LPTMR0 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>LPTMR1 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>SCT Out0 input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>SCT Out1 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>SCT Out2 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>SCT Out3 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>SCT Out4 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>SCT Out5 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>LP_FLEXCOMM0 trigger output 3 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>LP_FLEXCOMM1 trigger output 3 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>LP_FLEXCOMM2 trigger output 3 input is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>LP_FLEXCOMM3 trigger output 3 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>LP_FLEXCOMM4 trigger output 3 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>LP_FLEXCOMM5 trigger output 3 input is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>LP_FLEXCOMM6 trigger output 3 input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>LP_FLEXCOMM7 trigger output 3 input is selected</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>LP_FLEXCOMM8 trigger output 3 input is selected</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>LP_FLEXCOMM9 trigger output 3 input is selected</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>CMP1_OUT input is selected</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>CMP2_OUT input is selected</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>ENET_PPS_OUT_0 input is selected</description>
                  <value>0x2F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_TRIG1</name>
          <description>EXT Trigger Connections</description>
          <addressOffset>0x4C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>TRIG_OUTa pin input connections</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>PINT PIN_INT0 input is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>PINT PIN_INT1 input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>ADC0_IRQ input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>ADC1_IRQ input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>ADC0_tcomp[0] input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>ADC1_tcomp[0] input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>PWM0_SM0_MUX_TRIG0/PWM0_SM0_MUX_TRIG1 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>PWM0_SM1_MUX_TRIG0/PWM0_SM1_MUX_TRIG1 input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>PWM0_SM2_MUX_TRIG0/PWM0_SM2_MUX_TRIG1 input is selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>PWM0_SM3_MUX_TRIG0/PWM0_SM3_MUX_TRIG1 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>PWM1_SM0_MUX_TRIG0/PWM1_SM0_MUX_TRIG1 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>PWM1_SM1_MUX_TRIG0/PWM1_SM1_MUX_TRIG1 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>PWM1_SM2_MUX_TRIG0/PWM1_SM2_MUX_TRIG1 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>PWM1_SM3_MUX_TRIG0/PWM1_SM3_MUX_TRIG1 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>QDC0_CMP/POS_MATCH input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>QDC1_CMP/POS_MATCH input is selected</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>EVTG_OUT0A input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>EVTG_OUT0B input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>EVTG_OUT1A input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>EVTG_OUT1B input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>EVTG_OUT2A input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>EVTG_OUT2B input is selected</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>EVTG_OUT3A input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>EVTG_OUT3B input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>LPTMR0 input is selected</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>LPTMR1 input is selected</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>SCT Out0 input is selected</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>SCT Out1 input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>SCT Out2 input is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val31</name>
                  <description>SCT Out3 input is selected</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val32</name>
                  <description>SCT Out4 input is selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>SCT Out5 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>LP_FLEXCOMM0 trigger output 3 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>LP_FLEXCOMM1 trigger output 3 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>LP_FLEXCOMM2 trigger output 3 input is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>LP_FLEXCOMM3 trigger output 3 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>LP_FLEXCOMM4 trigger output 3 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val39</name>
                  <description>LP_FLEXCOMM5 trigger output 3 input is selected</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val40</name>
                  <description>LP_FLEXCOMM6 trigger output 3 input is selected</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val41</name>
                  <description>LP_FLEXCOMM7 trigger output 3 input is selected</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val42</name>
                  <description>LP_FLEXCOMM8 trigger output 3 input is selected</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val43</name>
                  <description>LP_FLEXCOMM9 trigger output 3 input is selected</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val44</name>
                  <description>CMP0_OUT input is selected</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val45</name>
                  <description>CMP1_OUT input is selected</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val46</name>
                  <description>CMP2_OUT input is selected</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val47</name>
                  <description>ENET_PPS_OUT_0 input is selected</description>
                  <value>0x2F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
