nxp-mcuxpresso/mcux-soc-svd/MCXN556S/MCXN556S_cm33_core1.xml
        <register>
          <name>RANGE_STAT</name>
          <description>MICFIL Range Status</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>RANGEOVF0</name>
              <description>Channel 0 Range Overflow Error Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF1</name>
              <description>Channel 1 Range Overflow Error Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF2</name>
              <description>Channel 2 Range Overflow Error Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF3</name>
              <description>Channel 3 Range Overflow Error Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range overflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range overflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF0</name>
              <description>Channel 0 Range Underflow Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF1</name>
              <description>Channel 1 Range Underflow Error Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF2</name>
              <description>Channel 2 Range Underflow Error Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF3</name>
              <description>Channel 3 Range Underflow Error Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_exception</name>
                  <description>No exception by range underflow</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>exception</name>
                  <description>Exception by range underflow</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSYNC_CTRL</name>
          <description>Frame Synchronization Control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSYNCLEN</name>
              <description>Frame Synchronization Window Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERID</name>
          <description>Version ID</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20F0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEATURE</name>
              <description>Feature Specification Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x742</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPAIR</name>
              <description>Number of Microphone Pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NPAIR_0</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_1</name>
                  <description>1 pair</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_2</name>
                  <description>2 pairs</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_10</name>
                  <description>...</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_11</name>
                  <description>...</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_12</name>
                  <description>...</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_13</name>
                  <description>...</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_3_14</name>
                  <description>...</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPAIR_15</name>
                  <description>15 pairs</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFO_PTRWID</name>
              <description>FIFO Pointer Width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTRWID_0</name>
                  <description>0 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_1</name>
                  <description>1 bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_2</name>
                  <description>2 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_3</name>
                  <description>...</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_4</name>
                  <description>...</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_5</name>
                  <description>...</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_6</name>
                  <description>...</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_7</name>
                  <description>...</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_8</name>
                  <description>...</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_9</name>
                  <description>...</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_10</name>
                  <description>...</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_11</name>
                  <description>...</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_12</name>
                  <description>...</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_13</name>
                  <description>...</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_3_14</name>
                  <description>...</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTRWID_15</name>
                  <description>15 bits</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIL_OUT_WIDTH_24B</name>
              <description>Filter Output Width</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WID16B</name>
                  <description>16 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WID24B</name>
                  <description>24 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOW_POWER</name>
              <description>Low-Power Decimation Filter</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_BYPASS</name>
              <description>Input DC Remover Bypass</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCACTIVE</name>
                  <description>Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCBYPASSED</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_OUT_BYPASS</name>
              <description>Output DC Remover Bypass</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCACTIVE</name>
                  <description>Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCBYPASSED</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
